plerup/easy_nrf52/src/lib/enrf.c
//====================================================================================
//
// enrf.c
//
// Simplified abstraction layer for the Nordic SDK
// Much of the code herein is taken from the Nordic SDK examples
//
// This file is part of easy_nrf52
// License: LGPL 2.1
// General and full license information is available at:
//   https://github.com/plerup/easy_nrf52
//
// Copyright (c) 2022-2024 Peter Lerup. All rights reserved.
//
//====================================================================================

#if defined(ENRF_SERIAL_USB) && defined(ENRF_SERIAL_UART)
#error Both usb and uart can not be used for enrf_serial
#endif

#define NRF_LOG_MODULE_NAME enrf
#include "enrf.h"
NRF_LOG_MODULE_REGISTER();

#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "app_timer.h"
#include "ble_nus.h"
#include "ble_nus_c.h"
#include "app_uart.h"
#include "app_util_platform.h"
#include "nrf_pwr_mgmt.h"

#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#ifdef ENRF_SERIAL_USB
# include "app_usbd.h"
# include "app_usbd_cdc_acm.h"
# include "app_usbd_core.h"
# include "app_usbd_serial_num.h"
# include "app_usbd_string_desc.h"

#elif defined(ENRF_SERIAL_UART)
#endif

#if BLE_DFU_ENABLED == 1
# include "nrf_dfu_ble_svci_bond_sharing.h"
# include "nrf_svci_async_function.h"
# include "nrf_svci_async_handler.h"
# include "ble_dfu.h"
# include "nrf_bootloader_info.h"
#endif

#define APP_BLE_CONN_CFG_TAG            1
#define APP_BLE_OBSERVER_PRIO           3

// Global variables
BLE_NUS_DEF(m_nus, NRF_SDH_BLE_TOTAL_LINK_COUNT);
BLE_NUS_C_DEF(m_ble_nus_c);
NRF_BLE_GATT_DEF(m_gatt);
NRF_BLE_QWR_DEF(m_qwr);
#if SDK_VERSION >= 17
NRF_BLE_GQ_DEF(m_ble_gatt_queue, /**< BLE GATT Queue instance. */
               NRF_SDH_BLE_CENTRAL_LINK_COUNT,
               NRF_BLE_GQ_QUEUE_SIZE);
#endif

static ble_gap_adv_params_t m_adv_params;
static uint8_t m_adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;
static uint8_t m_enc_advdata[BLE_GAP_ADV_SET_DATA_SIZE_MAX];
static ble_gap_adv_data_t m_adv_data = {
  .adv_data = {
    .p_data = m_enc_advdata,
    .len = sizeof(m_enc_advdata)
  },
  .scan_rsp_data = {
    .p_data = NULL,
    .len = 0
  }
};

static ble_gap_conn_params_t m_connection_param = {
  MSEC_TO_UNITS(20, UNIT_1_25_MS),
  MSEC_TO_UNITS(75, UNIT_1_25_MS),
  0,
  MSEC_TO_UNITS(4000, UNIT_10_MS)
};

static ble_gap_scan_params_t m_scan_params = {
  .active = 0,
  .interval = 0x00A0,
  .window = 0x0050,
  .timeout = 0,
  .scan_phys = BLE_GAP_PHY_AUTO
};

static uint8_t    m_scan_buffer[BLE_GAP_SCAN_BUFFER_EXTENDED_MIN];
static ble_data_t m_adv_rep_buffer = {.p_data = m_scan_buffer, .len = sizeof(m_scan_buffer)};

static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;
static uint16_t m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;

// Callbacks
static nrf_sdh_ble_evt_handler_t m_app_evt_cb = NULL;
static nus_rx_cb_t               m_app_nus_rec_cb = NULL;
static scan_report_cb_t          m_adv_report_cb = NULL;
static nus_c_rx_cb_t             m_nus_c_rx_cb = NULL;
static db_disc_cb_t              m_disc_cb = NULL;
static ble_db_discovery_t        m_ble_db_discovery;

// State variables
static bool        m_is_advertising = false;
static bool        m_is_central = false;
static const char *m_device_name = "";
static uint16_t    m_gatt_max_length;
static int         m_restart = 0;
static bool        m_long_range = false;
static int         m_tx_power = 0;
static bool        m_serial_active = false;

__WEAK void assert_nrf_callback(uint16_t line_num, const uint8_t *p_file_name) {
  app_error_handler(0xDEADBEEF, line_num, p_file_name);
}

//--------------------------------------------------------------------------

#if BLE_DFU_ENABLED == 1
static bool app_shutdown_handler(nrf_pwr_mgmt_evt_t event) {
  switch (event) {
    case NRF_PWR_MGMT_EVT_PREPARE_DFU:
      NRF_LOG_INFO("Power management wants to reset to DFU mode.");
      break;

    default:
      return true;
  }
  NRF_LOG_INFO("Power management allowed to reset to DFU mode.");
  return true;
}

NRF_PWR_MGMT_HANDLER_REGISTER(app_shutdown_handler, 0);

//--------------------------------------------------------------------------

static void ble_dfu_evt_handler(ble_dfu_buttonless_evt_type_t event) {
  switch (event) {
    case BLE_DFU_EVT_BOOTLOADER_ENTER_PREPARE:
      NRF_LOG_INFO("Device is preparing to enter bootloader mode.");
      break;
    case BLE_DFU_EVT_BOOTLOADER_ENTER:
      NRF_LOG_INFO("Device will enter bootloader mode.");
      break;
    case BLE_DFU_EVT_BOOTLOADER_ENTER_FAILED:
      NRF_LOG_ERROR("Request to enter bootloader mode failed asynchroneously.");
      break;
    default:
      NRF_LOG_ERROR("Unknown event from ble_dfu_buttonless.");
      break;
  }
}

//--------------------------------------------------------------------------

#endif

static void timers_init(void) {
  ret_code_t err_code = app_timer_init();
  APP_ERROR_CHECK(err_code);
}

//--------------------------------------------------------------------------

static void gap_params_init(void) {
  uint32_t err_code;
  ble_gap_conn_params_t gap_conn_params;
  ble_gap_conn_sec_mode_t sec_mode;

  BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

  err_code = sd_ble_gap_device_name_set(&sec_mode,
                                        (const uint8_t *)m_device_name,
                                        strlen(m_device_name));
  APP_ERROR_CHECK(err_code);

  memset(&gap_conn_params, 0, sizeof(gap_conn_params));

  gap_conn_params.min_conn_interval = m_connection_param.min_conn_interval;
  gap_conn_params.max_conn_interval = m_connection_param.max_conn_interval;
  gap_conn_params.slave_latency = m_connection_param.slave_latency;
  gap_conn_params.conn_sup_timeout = m_connection_param.conn_sup_timeout;

  err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
  APP_ERROR_CHECK(err_code);
}

