plerup/easy_nrf52/src/lib/enrf.c
  switch (event) {
    case APP_USBD_CDC_ACM_USER_EVT_PORT_OPEN: {
      // Setup first transfer
      app_usbd_cdc_acm_read(&m_app_cdc_acm, rx_buffer, READ_SIZE);
      m_acm_connected = true;
      break;
    }
    case APP_USBD_CDC_ACM_USER_EVT_PORT_CLOSE:
      m_acm_connected = false;
      break;
    case APP_USBD_CDC_ACM_USER_EVT_TX_DONE:
      m_acm_tx_done = true;
      break;
    case APP_USBD_CDC_ACM_USER_EVT_RX_DONE: {
      if (m_read_cb) {
        do {
          m_read_cb(rx_buffer[0]);
        } while (app_usbd_cdc_acm_read(&m_app_cdc_acm, rx_buffer, READ_SIZE) == NRF_SUCCESS);
      } else {
        ret_code_t ret;
        do {
          if (!m_input_available && rx_buffer[0] != '\r') {
            if (rx_buffer[0] == '\n' || m_input_pos >= READ_BUFF_SIZE) {
              m_input_available = true;
            } else {
              m_input_buffer[m_input_pos++] = rx_buffer[0];
            }
          }
          // Fetch data until internal buffer is empty
          ret = app_usbd_cdc_acm_read(&m_app_cdc_acm, rx_buffer, READ_SIZE);
        } while (ret == NRF_SUCCESS);
      }
      break;
    }
    default:
      break;
  }
}

//--------------------------------------------------------------------------

static void usbd_user_ev_handler(app_usbd_event_type_t event) {
  switch (event) {
    case APP_USBD_EVT_DRV_SUSPEND:
      break;
    case APP_USBD_EVT_DRV_RESUME:
      break;
    case APP_USBD_EVT_STARTED:
      break;
    case APP_USBD_EVT_STOPPED:
      app_usbd_disable();
      bsp_board_leds_off();
      break;
    case APP_USBD_EVT_POWER_DETECTED:
      NRF_LOG_INFO("USB power detected");
      if (!nrf_drv_usbd_is_enabled()) {
        app_usbd_enable();
      }
      break;
    case APP_USBD_EVT_POWER_REMOVED:
      NRF_LOG_INFO("USB power removed");
      app_usbd_stop();
      break;
    case APP_USBD_EVT_POWER_READY:
      NRF_LOG_INFO("USB ready");
      app_usbd_start();
      break;
    default:
      break;
  }
}

//--------------------------------------------------------------------------

ret_code_t enrf_serial_enable(bool on) {
  if (!on) {
    return NRF_ERROR_API_NOT_IMPLEMENTED;
  }
  m_serial_active = true;
  return NRF_SUCCESS;
}

//--------------------------------------------------------------------------

#define MILLIS (uint32_t)((uint64_t)NRF_RTC0->COUNTER * 1000 / APP_TIMER_CLOCK_FREQ)

ret_code_t enrf_serial_write_data(const uint8_t *data, size_t len) {
  ret_code_t res = NRF_SUCCESS;
  if (m_serial_active) {
    m_acm_tx_done = false;
    do {
      res = app_usbd_cdc_acm_write(&m_app_cdc_acm, data, len);
      app_usbd_event_queue_process();
    } while (res == NRF_ERROR_BUSY);
    uint32_t start = MILLIS;
    while (!m_acm_tx_done) {
      app_usbd_event_queue_process();
      if ((MILLIS - start) > 1000) {
        // APP_USBD_CDC_ACM_USER_EVT_TX_DONE seems not to be delivered sometimes.
        // Avoid lockup here
        break;
      }
    }
  }
  return res;
}
//--------------------------------------------------------------------------

ret_code_t enrf_serial_write(const char *str) {
  return enrf_serial_write_data((const uint8_t *)str, strlen(str));
}

//--------------------------------------------------------------------------

bool enrf_acm_connected() {
  return m_acm_connected;
}

#elif defined(ENRF_SERIAL_UART)

#define UART_TX_BUF_SIZE 256
#define UART_RX_BUF_SIZE 256

static void uart_event_handler(app_uart_evt_t *p_event) {
  uint8_t ch;
  switch (p_event->evt_type) {
    case APP_UART_DATA_READY:
      app_uart_get(&ch);
      if (!m_input_available && ch != '\r') {
        if (ch == '\n' || m_input_pos >= READ_BUFF_SIZE) {
          m_input_available = true;
        } else {
          m_input_buffer[m_input_pos++] = ch;
        }
      }
      break;

    default:
      break;
  }
}

//--------------------------------------------------------------------------

ret_code_t enrf_serial_enable(bool on) {
  uint32_t err_code = NRF_SUCCESS;
  if (on != m_serial_active) {
    if (on) {
      app_uart_comm_params_t comm_params;
      comm_params.rx_pin_no = RX_PIN_NUMBER;
      comm_params.tx_pin_no = TX_PIN_NUMBER;
      comm_params.flow_control = APP_UART_FLOW_CONTROL_DISABLED;
      comm_params.use_parity = false;
      comm_params.baud_rate = UART_BAUD_RATE;

      APP_UART_FIFO_INIT(&comm_params,
                         UART_RX_BUF_SIZE,
                         UART_TX_BUF_SIZE,
                         uart_event_handler,
                         APP_IRQ_PRIORITY_LOWEST,
                         err_code);
    } else {
      nrf_delay_ms(250);
      err_code = app_uart_close();
    }
    m_serial_active = on;
  }
  return err_code;
}

//--------------------------------------------------------------------------

ret_code_t enrf_serial_write(const char *str) {
  ret_code_t err_code = NRF_SUCCESS;
  if (m_serial_active) {
    for (size_t i = 0; i < strlen(str) && err_code == NRF_SUCCESS; i++) {
      err_code = app_uart_put(str[i]);
    }
  }

  return err_code;
}

//--------------------------------------------------------------------------

#else

ret_code_t enrf_serial_enable(bool on) {
  m_serial_active = on;
  return NRF_SUCCESS;
}

//--------------------------------------------------------------------------

ret_code_t enrf_serial_write(const char *str) {
  return NRF_ERROR_API_NOT_IMPLEMENTED;
}

//--------------------------------------------------------------------------

size_t enrf_serial_read(char *str, size_t max_length) {
  return 0;
}

#endif

static bool delay_timeout = false;
static void delay_timeout_proc(void *p_context) {
  delay_timeout = true;
}

void enrf_delay_ms(uint32_t ms) {
  static bool initated = false;
  APP_TIMER_DEF(id);
  if (!initated) {
    app_timer_create(&id, APP_TIMER_MODE_SINGLE_SHOT, delay_timeout_proc);
    initated = true;
  }
  delay_timeout = false;
  app_timer_start(id, APP_TIMER_TICKS(ms), NULL);
  while (!delay_timeout) {
    enrf_wait_for_event();
  }
}

