plerup/easy_nrf52/src/lib/enrf.c
//--------------------------------------------------------------------------

bool enrf_init(const char *dev_name, nrf_sdh_ble_evt_handler_t ble_evt_cb) {
  ret_code_t err_code;
  m_device_name = dev_name;

  bool do_log = true;
#ifdef ENRF_ENABLE_LOG_PIN
  // Log control pin defined, must be low for log to be enabled
  nrf_gpio_cfg_input(ENRF_ENABLE_LOG_PIN, NRF_GPIO_PIN_PULLUP);
  nrf_delay_ms(1);
  do_log = nrf_gpio_pin_read(ENRF_ENABLE_LOG_PIN) == 0;
  nrf_gpio_cfg_default(ENRF_ENABLE_LOG_PIN);
#endif
  if (do_log) {
    log_init();
  }
#if BLE_DFU_ENABLED == 1
  err_code = ble_dfu_buttonless_async_svci_init();
  APP_ERROR_CHECK(err_code);
#endif
  timers_init();

#ifdef ENRF_SERIAL_USB
  app_usbd_serial_num_generate();
  err_code = app_usbd_init(&m_usbd_config);
  APP_ERROR_CHECK(err_code);
  app_usbd_class_inst_t const *class_cdc_acm = app_usbd_cdc_acm_class_inst_get(&m_app_cdc_acm);
  err_code = app_usbd_class_append(class_cdc_acm);
  APP_ERROR_CHECK(err_code);
  err_code = app_usbd_power_events_enable();
  APP_ERROR_CHECK(err_code);
#endif

  power_management_init();
  ble_stack_init();
  gap_params_init();
  gatt_init();
  services_init();
  conn_params_init();
#if SDK_VERSION >= 17
  ble_db_discovery_init_t db_init;
  memset(&db_init, 0, sizeof(ble_db_discovery_init_t));
  db_init.evt_handler = db_disc_handler;
  db_init.p_gatt_queue = &m_ble_gatt_queue;
  err_code = ble_db_discovery_init(&db_init);
#else
  err_code = ble_db_discovery_init(db_disc_handler);
#endif
  APP_ERROR_CHECK(err_code);

  m_app_evt_cb = ble_evt_cb;

  NRF_LOG_INFO("%s, version: %s %s", dev_name, _build_version, _build_time);
  NRF_LOG_INFO("Mac address: %s", enrf_get_device_address());

  return true;
}
